#version: 0.2
C C
O )
C (
CC CC
c c
[ C
[C @
H ]
= O)
C )
( O)
[C@ H]
C( =O)
C =
[C@ @
c 1
( C)
[C@@ H]
CCCC CCCC
( =O)
C( O)
c 2
( C
CC C=
C 1
c (
C( C)
c1 cc
O C
c (O)
c 3
[C@H] (O)
CC C
CCC= CCC=
C O
[C@H] (C
C= C
P (=O)
c2 cc
O C(=O)
O C(
CCCC CC
O CC
/ C=C
C 2
[C@@H] (O)
C(O) C(O)
[C@@H] (
P(=O) (O)
N )
CC (=O)
[C@H] (
[C@H] 1
C O)
O [C@H](C
[ O
O =
[O -
C(=O) O)
CC (C)
CC 1
[C@@H] 1
[O- ]
C 3
2 )
c3 cc
OC(=O) CCCCCCCC
[O-] )
[C@ ]
c(O) cc
c 4
N C(=O)
OC( CO)
/C=C /
c n
O P(=O)(O)
+ ]
C(=O) N
[C@H] 2
O [C@@H]
c1cc cc
[ n
O C)
= C
) cc
O[C@H](C O)
c 1</w>
[ N
[n H]
[C@@ ]
CO c1cc
OC(CO) C(O)C(O)
(C) CC
/C=C \
( [O-])
c(O) c(O)
[C@@H] (C
[N +]
CCC 2
c1 )
C(=O) O</w>
C(=O) OC
c2cc cc
O C1
c (=O)
3 )
F )
C(C) (C)
[C@H] 3
C 4
= O</w>
c (C
CCC=CCC= CCC=CCC=
CCCCCC =
c( -
CCC 4
P(=O) ([O-])
c2 )
OC 2
CC (
CO P(=O)(O)
C(C) =O)
CCCCCCCC CCCCCCCC
(C) (C)
cc (O)
C1 O</w>
CC =
C [C@H](O)
C N
C 5
c1 n
1 )
S (=O)
CC (O)
( C(=O)O)
[N+] (C)(C)
CCCC C
c1cc c(
[C@@H] 2
CC N
c2 c(
C= C(
C2 O)
= C(
P(=O)([O-]) OCC
CCC= CCCCCCCC
[C@@H](O) [C@H](O)
P(=O)([O-])OCC [N+](C)(C)
c( OC)
C(C) C)
C( OC
CO C(=O)
C( =
S(=O) (=O)
[C@H](O) [C@H](O)
O= C(
cc (
C(=O)OC [C@H](C
(C O)
O= C(O)
c1 O</w>
C(C) =C
= N
c (C)
CC 2
O [C@]
O[C@H](C OC(=O)CCCCCCCC
O [C@@H](
N C(C)=O)
O) [C@H](O)
O[C@@H] 2
CC C1
C= CCCCCCCC
CCC 3
c 5
4 )
CCCC (=O)
cc 1
[C@@H] 3
l )
c4 cc
CCCCCC C</w>
cc 1</w>
O [C@@H]1
[C@@] 2
OP(=O)(O) O)
C c1cc
C 6
C /C=C\
c( N)
C[C@H](O) [C@@H](
CCCCCCCC C</w>
C= C(C)
C3 O)
c3 )
CC C(
C 1</w>
(C(=O)O) C[C@H](O)[C@@H](
(C(=O)O)C[C@H](O)[C@@H]( NC(C)=O)
CCCCCCCC (=O)
c2 n
/ C=C(
[C@@H] (C)
(C(=O)O)C[C@H](O)[C@@H](NC(C)=O) C(
OCC (O)
O C(C)
(C) C3
CCCCC C</w>
OC [C@H](C
COc1cc (
CC 3
CCCCCC= CCC=CCC=
CC(C) =
CC [C@]
c1 2</w>
c3cc cc
OC 3
C1 CCC2
c2cccc c2
c1cccc c1</w>
cn c3
C) COP(=O)(O)
N =
O [C@H]1
c2cc (O)
[C@H] (C)
[C@H] 4
n 2
C) OC(=O)CCCCCCCC
[C@@H](C O)
CCCC (C)
c1cccc c1)
CCC= CCCCCC
c3cc (O)
[C@H]1 O</w>
c1cc (O)
C= C1
C [C@H](
( F)
c(N) n
CC C(C)
CC C(=O)
cc 2
O 1</w>
CC(=O) N
C1 O)
[C@H]( O[C@@H]
[C@@H]1 O</w>
CCC N
C O</w>
/ C(C)=C
l )cc
3 C)
\ C)
O P(=O)([O-])OCC[N+](C)(C)
c2cccc c2)
P(=O)([O-])OCC[N+](C)(C) C</w>
CO P(=O)([O-])OCC[N+](C)(C)C</w>
OP(=O)(O) OCC
c [nH]
cc 3
CC 1</w>
1 2
n 1
CC1 (C)
c(O)cc (O)
CCCCCC (=O)
O [C@H](
OC [C@H]1
CCC3 (C)
OCC N</w>
O[C@H](CO) [C@@H](O)[C@H](O)
CC1 =
CC )
OC(=O) CCCC
CC(=O) O)
C(O)C(O) C1O</w>
O= C1
CC C(=O)O)
C c1
F )cc
C 7
CCCCCCCC CCCC
O 3)
C(C) C</w>
c2cc c(
CCCCCC= CCC=CCCCCCCC
C [C@]
OP(=O)(O)OCC N)
c1cc c(O)cc
OC 6
C(=O) O[C@H](COC(=O)CCCCCCCC
CC [C@@]2
OC 4
/C=C( \C)
C S
[C@H]2 O)[C@H](O)
c2c( c1)
OCC 1
O[C@H](CO) [C@@H](
c2cc (
c3 c(
CCCCCCCC C=CCCCCCCC
C6 O)
. [
F) (F)
c2cc c(O)cc
[C@H]2 O)
OC(=O)CCCCCCCC =
CCC= CCCC
CCN (
CC(C) (C)
[C@H](O)[C@H](O) CO)
CCC 5
C(O) =N
c1cc (
c( N
5 )
C1 =O</w>
CCC= CCCCCC</w>
[C@H]( O[C@]
[C@@] 1
(C) C)
O[C@H](CO) [C@H](O)
O 2)
/ C(
C4 O)
N= C(O)
CC C</w>
1 C</w>
C [C@@H](O)
O[C@H](CO)[C@@H]( O[C@@H]2
O C</w>
c(O)c(O) c1)
(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C( [C@H](O)[C@H](O)CO)
N c1n
= CC(=O)
OC[C@H]1 O[C@@H](
cc c1O</w>
O[C@@H] (CO)
OCC(O) C(O)
c(C l)cc
c1cccc c1
C=C \
CC NC(=O)
[C@H]( N)
O .
CC [C@H]2
OP(=O)([O-])OCC[N+](C)(C) C)OC(=O)CCCCCCCC
OC(CO)C(O)C(O) C2O)
C) COP(=O)([O-])OCC[N+](C)(C)C</w>
C( F)(F)
O[C@@H]1 O[C@H](CO)[C@@H](O[C@@H]2
OC(CO)C(O)C(O) C3O)
C5 CCC4
O C(C)=O)
(C) C</w>
C)COP(=O)(O) OCCN</w>
CCCC CCC=CCCCCCCC
S(=O)(=O) O)
/C(C)=C /
c2 c1
C5 (C)CC
2 c(
O[C@H](CO) [C@H](O)[C@H](O)
C [C@H]1
c(O)c(O) c2)
OC(CO) C(O)
[C@H](O) [C@@H](CO)
O[C@@H](CO) COC(=O)
S )
c2ccc(O)cc 2)
B r
OC2 OC(CO)C(O)C(O)C2O)
N =C(
CC =C
c3cccc c3
OC( C
O3) [C@H]2O)[C@H](O)
[C@H](O[C@] 3
[C@H](O)[C@@H](CO) O[C@]
C7 O)
C [C@@H]1
(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C( [C@H](O)[C@@H](CO)O[C@]
CCC4 C5(C)CC
[O- ]</w>
O 4)
C/C=C\ C/C=C\
OC( C(=O)O)
CCCCCCCC CCCCCC
O[C@H]1 C(O)C(O)
N 1
CCC1 2
CN 1
c4 )
c(=O) [nH]
[C@@H](O) [C@@H]1O</w>
C(= N)
c2 [nH]
4 (C)
N) =O)
OC1 OC(CO)C(O)C(O)
CO C1
c o
n2 cnc3
[C@@H] 4
O [C@H]2
c(O) c(OC)
c(- c3cc
[C@H](O[C@@H] 3
OCC1 OC(
O3)[C@H]2O)[C@H](O) [C@H]1
C(O) C(C)(C)
cnc3 2)
C(C) CCC=
C( CO)
/C( =C
c1cc c(O)c(O)c1)
C(=O)N [C@@H](C
C 2</w>
[C@H]4 O)
CCCCCCCC CCCCCCC</w>
C [C@@H](
c(C l)
OC [C@@H](O)
(C) C4
n 1</w>
c3 c(=O)
CC OC(=O)
CC(C) C)
OC(C) C(O)C(O)
O P(=O)([O-])
c2cc 3
O 2</w>
CCC=CCCCCC )
C1 =
OP(=O)(O)OCCN) OC(=O)CCCCCCCC
CCC=CCC=CCC=CCC= CCC=CCC=
CO c1
C1CCC2 C3
c 6
C5CCC4 3C)
c(O) c(
O[C@@H]1O[C@H](CO)[C@@H](O[C@@H]2 O[C@H](CO)
C( C
c(N)n cnc32)
C(=O)N [C@@H](
c1cccc (
[C@H]3 O)
[N+] (=O)
n2cnc3 c(N)ncnc32)
C(OC 7
2) cc1</w>
c(O)c(O) c1</w>
/C=C/ C(C)=C
N 2
c3 c2
C1 2
O[C@@H]1O[C@H](CO)[C@@H](O[C@@H]2O[C@H](CO) [C@H](O[C@@H]3
o +]
\ C=C\
[ o+]
CCC=CCC=CCC=CCC=CCC=CCC= CCCC(=O)
CC [C@@]
CC C(O)
CCCC C</w>
O) OC(=O)CCCCCCCC
c1ccc(O)cc 1)
CC /C=C(\C)
C2O) C(O)C(O)C1O</w>
C2 )
c2 o
= CCC=CCC=
CC S
O= c1
C /C=C/
/ C)
C(OC 3
1 C)
OP(=O)(O) OP(=O)(O)
c2 c1</w>
+ 2
cn 2
CC(=O) O</w>
O 5)
[C@@H]( OP(=O)(O)O)
C[C@] 12
c s
CC1 OC(
)cc 1</w>
cc 4
CCC=CCC= CCC=CCCCCCCC
C(=O)N 1
O c1cc
C(OC 6
C #
CCCCCCCC(=O) OC[C@H](C
] .
( C(=O)
c3 n
C5CCC43C) C2
[N a
C(C)CCC= C(C)CCC=
CC(C) =O)
C(=O)OC 2
OCC 2
cc( -
c2 1</w>
c(O)c(O) c3)
c(- c2cc
OC 5
O= P
[O-] .
CCCCCC=CCC=CCC= CCC=CCCC
CC #
(C) C1
(C 2
c3cccc c3)
[C@@H]2 O)
+ ]</w>
C=C(C) /C=C/
(C l)
C(=O)OC[C@H](C OP(=O)(O)
C(= CCC4C5(C)CC
C =O)
c5 cc
cc( OC)
[N+](=O) [O-])
OCC (C
CC= C(C)C)
O[C@H](C O
c3cc (
[C@H](O[C@]3 (C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@@H](CO)O[C@]
[C@H](O[C@]3(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@@H](CO)O[C@] 4
CC c1
c3cc(O) cc(O)
[C@H]3 CC(C)=O)
[C@@H](O) [C@H](C
O[C@H]1C(O)C(O) C(O)
CC /C=C\
OC(CO)C(O)C(O) C4O)
O=C( [O-])
CC1 CCC2
OC[C@H]1O[C@@H]( n2cnc3c(N)ncnc32)
NC(=O) [C@H](
[C@H]1 CC[C@H]2
O4) O3)[C@H]2O)[C@H](O)[C@H]1
c4 cc(O)
N C(
C n1
C C</w>
C5 O)
c4cc c(O)cc
O[C@H](CO) [C@@H](O)
CCC=CCC=CCC=CCC= CCC=CCCCCC
cc c1
COc1cc c(
C= CCC=CCC=
C( OC(=O)
C c1ccc(
[C@H](O) [C@@H](O)
[C@H](O[C@@H] 4
OC(=O)CCCC =CCC=CCC=
CC C(=O)N
4(C) [C@H]3
C(=O)OC[C@H](C OP(=O)([O-])OCC[N+](C)(C)C)OC(=O)CCCCCCCC
(C) C(
c3cc c(
[ S
O[C@@H] 3
COc1cc( -
OC3 OC(CO)C(O)C(O)C3O)
N [C@@H](C
C l</w>
CCCC(C) =
CC 4
cn c2
CC1 2
c4cc cc
c4 c(
O=C( /C=C/
O) NC(=O)
CC(=O) OC1
n c(
C l)
OP(=O)(O) O</w>
= CCCCCCCCC</w>
3 )cc
CC 2)
C6 OC6
C(=N) N)
C c1n
Br )
5 (C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO)
5(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO) O5)
n (
c(O)cc 3)
C1 (C)CC
CC /C(C)=C/
[C@@H]( N)
CC(C)= CCC
cc 2)
c1cc(O) c(O)c(O)c1</w>
c(=O) o
O[C@H](CO)[C@H](O) [C@H](O[C@@H]4
COc1cc( /C=C/
CCC4 (C)C3
C(O) C1O</w>
OC 7
S S
O S(=O)(=O)O)
CC1 =C(
CC OCC
C(=O) O[C@@H](CO)COC(=O)
C NC(=O)
c2 3)
/C=C( /C)
OP(=O)([O-])OCC[N+](C)(C) C)
CCCCC /C=C\
CCCCCCCCCCCCCC =C
CC3 C4
] (=O)
I )
CCCCCCCCCCCCCC=C [C@@H](O)[C@H](C
CCCCCC= CCC=CCC=CCC=CCC=
CCC=CCC=CCC=CCC= CCC=CCCC
3 (C)
CCC12 C</w>
C= O</w>
C5CCC43C)C2 C1</w>
c[nH] c2cccc
C(F)(F) F)
(O) (O)
COc1cc (O)
o 1</w>
c1ccc(O)cc 1</w>
O[C@@H]1O[C@H](CO)[C@@H](O[C@@H]2O[C@H](CO)[C@H](O[C@@H]3 O[C@H](CO)[C@H](O)[C@H](O[C@@H]4
(C =O)
c2cc c(O)c(O)c2)
O. O.
CCC3(C) C(=CCC4C5(C)CC
O c2cc(O)
CC=C 4
n 3
[C@H](O) [C@@H]1
[C@H] 5
c1 2)
/C(=C \
= CCCCCCCC
OC(CO)C(O)C(O) C6O)
(C)CC (O)
c1n cn2
N (
C2 =
c4 c3
CC(C) (O)
c2 O)
OC4 OC(CO)C(O)C(O)C4O)
OC1OC(CO)C(O)C(O) C1O</w>
O= S(=O)
COP(=O)(O) OCCN</w>
c1 =O</w>
c(C 2
[n +]
c1 cn
c(OC) c(OC)
CC[C@] 4(C)[C@H]3
n 2)
c1 O)
CCCC 1
cc 1)
S CCNC(=O)
2c( cc1
SCCNC(=O) CCNC(=O)
c(O)cc 3
c2 )cc
CCCCCC=CCC=CCC=CCC=CCC= CCCC(=O)
CC [C@H]3
[ P
CCC=CCC=CCC=CCC= CCCCCC(=O)
CC [C@@H]1
C(=O)OC[C@H](C O)OC(=O)CCCCCCCC
+2 ]</w>
c2 -
[C@H]4O) [C@H]3CC(C)=O)
OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32) [C@H](O)[C@@H]1
O)[C@H](O) CCCCCCCCCCCCCCC</w>
CCC5 (C)C4
C(O) C(C)
C [C@H]2
(=O) =O)
( N)
c1 C</w>
] .[
N [C@@H](
CCCC CCC
[C@@]1 (C)CC
C2 =O</w>
CCCC(C)= CCCC(C)=
CC(=O) [O-])
C3 =
O C(C)(C)
CC[C@@]2 1C</w>
C= CC
C(=O)OC[C@H](C OP(=O)(O)OCCN)OC(=O)CCCCCCCC
COP(=O)(O) OP(=O)(O)
CN (C)
N (C)
CCC4 =CC(=O)
CC( OC6
C(OC 4
[C@] 1
CCCCCCCC CCC</w>
CC1(C) CCC2
OC(CO)C(O)C(O) C7O)
O=P (O)(O)
CCCCCCCCCCCC C</w>
CCCC 2
CC [C@H](
C /
# N)
N c1cc
N S(=O)(=O)
CN (
c1cccc 2
[C@@H](C OC(=O)CCCCCCCC=
N=C( N)
+ 3
C1 )
c4ccc(O)cc 4)
cn (
[N H
OC(C) =O</w>
N #
C( OP(=O)(O)O)
COP(=O)(O) O</w>
C(C) (O)
o c(=O)
c2 c(=O)
C(O)C(O) C2O)
C( OC2
cnc2 c1ncn2
cc (C)
O [C@H]3
C 8
n 4
c1 c(
O[C@H]( C(=O)O)
C(OC6 OC(C(=O)O)
C(C)(C) O)
C(=O)N 2
o c2cc(O)
[C@@H](O) [C@H]1O</w>
N 3
CCCCCC C)COP(=O)(O)
CCCC(=O) O</w>
cc(O) c(O)
c1cc c2c(c1)
CC1OC( OC2
CC [C@@H](C)
[C@@] (C)
CCC [C@H]1
CC [C@@H]2
CC O
CCCCCCCC(=O) O[C@H](COC(=O)CCCCCCCC
C(=O)O) C(=O)O</w>
CC[C@] 2
CC/C=C(\C) CC/C=C(\C)
C1CCC2 (C)C3
cc1 O</w>
[nH] c(
[Na +]</w>
C(O) C1
= C(O)
( OC1
c3cc 4
CCCCCCCCCCCCCCCC (=O)
c3 -
[P @
N CC
CC[C@@]2 1C)
C3 )
c1cc( -
[C@] 2
COc1cc 2
CCCN 1
CCCCCC=CCC=CCC= CCC=CCCCCC
CCCC C=CCCCCCCC
C1O) OC(=O)CCCCCCCC
C( N)
cc cc
NC(=O) [C@H](C
N 1</w>
C=C(C) \C=C\
4 3C)
O 1)
C1 C2
c(O)c(O) c4)
CCCCCC )
= N)
c2ccccc2 1</w>
CCCCCCCC CC
CC= CCCCCCC</w>
C1 =C
C(O) C2O)
C(=O)OC[C@H](C OP(=O)(O)OCCN)
cc(O) c12</w>
c(O)cc 2
[C@@] 3
O[C@@H] 4
OC[C@H](C OP(=O)([O-])OCC[N+](C)(C)C)OC(=O)CCCCCCCC
C(=O) C(
C c1ccccc1</w>
(C l)cc
o 2)
c2cc(O) c(O)c(O)c2)
[O-] .[
C3 (C)CC
cn c5
OC1OC(CO)C(O)C(O) C1O)
OC(CO)C(O)C(O) C1O</w>
OC [C@H]2
CC [C@@H]3
C [C@H]3
s 1</w>
c2cc 1
O[C@H]1C(O)C(O)C(O) [C@@H](O)
OCC2 OC(
CCC12 C)
CC c1cc
C=C 2
c2 c(O)cc(O)
[C@H](N) C(=O)O</w>
OCC OCC
Cc1cc (
CCCN 2
C(OP(=O)(O)O) [C@@H](OP(=O)(O)O)
( C(=O)OC
c3c2 =O)
c1 c(O)cc(O)
CC= C(C)
CC1 )
/ N
c3cc 2
CCCCCC=CCC=CCCCCCCC CCCC
C [C@@H]2
+] .
(O) (
c(O) c1
CCCCCCCCCCCCCCCC CC(=O)
CC 5
= CCC=CCCCCC</w>
[C@H]1CC[C@H]2 [C@@H]3
[C@H](O) C(C)(C)
O c2
C[C@H]( N)
C(=O) OC1
c3cc c(O)cc3)
F e
CCCCCC=CCC=CCC= CCCCCC(=O)
CCCCC 1</w>
/C=C/ C=C(C)/C=C/
c3 c(O)cc
c2 =O)
C= CCCCCCCCCCCCCCCC
O[C@@H] (C)
CCCCCCC=CCCCCCCC CC
C( N)=O)
( OC)
c3c(=O) c2
CCC /C=C\
C(O) C2
= S)
n n
c4cc(O) cc(O)
c(C =O)
O c1cc(O)
C(=O)N [C@H](
[C@H]4O)[C@H]3CC(C)=O) [C@H](O[C@]3(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@@H](CO)O[C@]4
OC1 CC3C4
OC(CO)C(O)C(O) C5O)
C1 (C)
5(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO)O5) O4)O3)[C@H]2O)[C@H](O)[C@H]1
(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@@H](CO)O[C@] 5(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO)O5)O4)O3)[C@H]2O)[C@H](O)[C@H]1
](=O) (O)
Nc1n cnc2c1ncn2
CC [C@H]4
C( OC(C)=O)
O c1ccc(
CCCN C(=N)N)
C2 =O)
C(C) =O</w>
O[C@H](C OC(=O)CCCC
OC( COC(=O)
O=C( N
N C1=O</w>
CCCCCCCCC=CCCCCCCC CCCCCC
CC(C) (
C1 CC
c(C 3
O[C@H](C(=O)O) [C@@H](O)[C@H](O)
COc1cc c(-
[C@@H]3 O)
O[C@H]1C(O)C(O) C(OP(=O)(O)O)[C@@H](OP(=O)(O)O)
OC(=O) /C=C/
CC[C@] 12
CCN 1
CC2 3
CC O)
/C=C /C=C/
cc n
c(=O)[nH] 1</w>
[C@H](N) C(=O)O)
[C@@]1 (O)
CC= CCCCCCCCC</w>
C6OC6 OC(CO)C(O)C(O)C6O)
C(O) CC1
cc c3
O c3
COP(=O)(O)OP(=O)(O) OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1
CCC(=O) O[C@H](COC(=O)CCCCCCCC
CC1= C(C)
CC(C)= CCc1
C8 O)
C2 (C)
C(C)(C) C)
C(=O) O
OC O
CCCCCCCC C=CCC=CCC=
CCCCCCCCC=CCC=CCC= CCCC
C2 3
/C(C)=C \
c1 -
O C=CCCCCCCC
CCCC N)
CCC5(C)C4 CCC3(C)
o c3
cc 5
c -
SCCNC(=O)CCNC(=O) C(O)C(C)(C)
C(=O)N1 CCC[C@H]1
4 (C)C3
(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO) O4)O3)[C@H]2O)[C@H](O)[C@H]1
c4cc c(O)c(O)c4)
COP(=O)(O) OC
CC[C@@]2 (C)
CCCCCC C)OC(=O)CCCCCCCC
C(C) =
- ]
c1cc c(-
c( C(=O)O)
O c2cc3
N (C)C)
CCC=CCC=CCC=CCC= CCCCCCCC(=O)OC[C@H](C
C1 2</w>
C( C(=O)O)
[C@H](O[C@]3 (C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO)
OCC1OC( OC2
O C(O)
CCCCCCCC C)OC(=O)CCCCCCCC
CCC=CCC=CCC=CCC=CCC=CCC=CCCC(=O) OC[C@H](C
C7 OC7
/C(=C /
cc (C
c1 c(C)
c 7
[C@H](O) [C@@H](O)[C@@H]1O</w>
N CCC
CC (C
C(=O) OCC(C
(OC1 )
cc 3)
[C@@H]( NC(=O)
N CCCC
CC(C)= CCCC(C)
C /C(=C\
c(O)cc(O) cc3
O[C@H]1C(O)C(O)C(O) [C@@H](OP(=O)(O)O)
C= CC(=O)
C(=O) [O-]</w>
OC(=O)CCCCCCCC= CCCCCCCCC</w>
CC[C@H]2 [C@@H]3
CC(C) (C
C1C2 C</w>
c3 O)
[Na +].
CCCCCC C)COP(=O)([O-])OCC[N+](C)(C)C</w>
CC(=O) OCC
CC( N)
C(O)=N [C@@H](
C(= C)
c2[nH] 1</w>
[N+](C)(C) C</w>
[C@H] 6
[C@@H](C OC(=O)CCCCCCCC
O[C@@H]1O[C@H](CO)[C@@H](O[C@@H]2O[C@H](CO)[C@H](O[C@@H]3O[C@H](CO)[C@H](O)[C@H](O[C@@H]4 O[C@H](CO)[C@H](O)[C@H](O)
O[C@@H]1O[C@H](CO)[C@@H](O[C@@H]2O[C@H](CO)[C@H](O[C@@H]3 O[C@H](CO)[C@H](O)[C@H](O)
CCCCCCCCC=CCCCCCCC CCCC
C= CC(C)(C)
C(O) CC2
C(CO) OC(
C(=O) [O-])
Br )cc
4 )cc
[C@@] 12
[C@@H](O) [C@@H](O)
O=C(/C=C/ c1ccc(O)cc1)
CCC2 (C)
C=CCCCCCCC CCCCCC</w>
C(OC 8
C(= N
(OC1) OC1CC3C4
O c2cc
CC[C@] 4(C)C3
CCC 6
CC1 (O)
C(F)(F) F)cc
c1cc 2
[C@H](O[C@]3(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO) O3)[C@H]2O)[C@H](O)[C@H]1
O[C@H](CO)[C@H](O) [C@H](O[C@]
O[C@H](CO)[C@@H](O)[C@H](O) [C@H]2O)
CC1= CC(=O)
C1 C</w>
= CC(C)
O[C@H](CO)[C@@H](O)[C@H](O) [C@H]3O)
NC(=O) C(
CCC [C@@H](C)
CC [C@@H]4
C2 C3
C(C) (CO)
C(=O) OCC
c[nH]c2cccc c12)
c(- c4ccc(O)cc4)
[P@ @
O[C@H](CO C=CCCCCCCC
CC O</w>
C(C)CCC=C(C)CCC= C(C)CCC=C(C)CCC=
2) CC1</w>
cn 1</w>
c3cc c(O)c(O)c3)
c2cc c(Cl)cc
c(O) c1</w>
OCC(O) COP(=O)(O)OC
OC(CO) C(OC7
O)NC(=O) CCCCCCCCCCCCCCCC
CCCCCCCC C)COP(=O)(O)
CCCCCC C)COP(=O)(O)OCCN</w>
CCCC(C) CCCC(C)
CCC= C(C)C)
CC1 (C)CC
CC/C(C)=C/ CC/C(C)=C/
CC(C)=CCC /C(C)=C/
/C=C/ C(=O)
n (C)
co 1</w>
c3cc(O) c(O)c(O)c3)
c3c( c2)
c1cccc (O)
c1 OC</w>
c( F)
[C@@H](O) C
[C a
OCC 3
CCCC (C)(C)
CC1CCC2 (OC1)OC1CC3C4
CC C(=O)O</w>
C6O) C(C)(C)
C(O)C(O) C3O)
43C) [C@@H]1
/C=C/C(C)=C /C=C/C(C)=C
c1cc(O) c(O)c(O)c1)
[C@@H](O) [C@H]2O)
O= c1cc(-
COc1cc 2c(cc1
COP(=O)(O)OP(=O)(O)OC[C@H]1O[C@@H](n2cnc3c(N)ncnc32)[C@H](O)[C@@H]1 OP(=O)(O)O</w>
CC [C@H]1
C1 (O)
- ].
OC[C@H]2 O[C@@H](
OC O2</w>
CCCCCC (O)
CC 2</w>
C1CCC2 (C)C1
( CC)
c2cccc (
[C@H]5 O)
[C@H](C O)
O=S(=O) (O)
Cc1cc (O)
CCCCCCCC C)COP(=O)(O)OCCN</w>
CC=C 5
CC(=O)O) C(=O)O</w>
CC( N)=O)
C l
(C(=O)OC 3
c( C(=O)
[C@@H]1 O[C@H](C
O[C@H](CO)[C@H](O)[C@H](O[C@] 5(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO)O5)
O[C@H](CO)[C@@H](O)[C@H](O) [C@H]1O</w>
O[C@@H]1O[C@H](CO)[C@@H](O[C@@H]2O[C@H](CO)[C@H](O[C@@H]3O[C@H](CO)[C@H](O)[C@H](O[C@@H]4 O[C@H](CO)[C@H](O)[C@H](O[C@]5(C(=O)O)C[C@H](O)[C@@H](NC(C)=O)C([C@H](O)[C@H](O)CO)O5)
O[C@@H]1O[C@H](CO)[C@@H](O[C@@H]2 O[C@H](CO)[C@H](O)
O[C@@H] 5
M g
C=C1 CC23
cc(OC) c1O</w>
c2 [o+]
c1cc c(Cl)cc
c(=O) c2
[C@] 3
S (C)
OC5 OC(CO)C(O)C(O)C5O)
O S(=O)(=O)
CO C(
CC[C@]4(C)[C@H]3 CC[C@@]21C</w>
CC(=O)N [C@H]1
CC 3)
C1 =N
oc2cc(O) cc(O)c12</w>
cc1 OC</w>
c2n 1</w>
[O- 2
[N+] ([O-])
Oc1cc(O) c2c(c1)
CCCCCCCC /C=C\
CCCCCC=CCC=CCC= CCCCCCCC(=O)OC[C@H](C
CCC= C(C)C</w>
CCC( C(O)
CC3 (C)
CC /C=C/
C1 OC1
C(C) C2
C(=O) C(C)(C)
6 )
(C)CC 3
c3cc4 c(
c1cc cn
OC1 =O</w>
C[C@]12 CC[C@H]3
CCC C</w>
S (N)
NC(=O) N
COc1cc (C2
CCN( CC)
CCCCCCCCCCCCCCCC CCCCCCCC
C(O)CC1 C3(C)CC
n cn
c2ccc(O)cc 2
c1cc c(C
OC(CO)C(O)C(O) C4
CCCCCCCC C)COP(=O)([O-])OCC[N+](C)(C)C</w>
CCC4 C(C)
CC# CC#
=C( C(=O)
c4cccc c4
[O H
[C@H]1 O)
Oc2 c(-c3cc
O[C@@H]2 O[C@H](CO)[C@@H](O)[C@H](O)[C@H]2O)
OC[C@H](C OP(=O)(O)OCCN)OC(=O)CCCCCCCC
O)[C@H](O) C=CCCCCCCCCCCCCC</w>
CC(O) CCC4(C)C3
CC C)
(=O) c3
% 1
o c2
c[nH]c2cccc c12</w>
c4c3 =O)
S(N) (=O)=O)
O[C@H]( c1ccc(O)c(O)c1)
OC[C@@H](O) CO</w>
O= [N+]([O-])
N c1ccc(
CO [C@@H]1
CC(C) C(C)
C(O) C6O)
= CCC=CCCCCC)
([O-]) ([O-])
c3cc(O) c(O)c(O)
c2 cn
c2 c[nH]
]. [O-2
[C@] (C)
[C@@H]2 O[C@H](C
[C@@H](COC(=O)CCCCCCCC= CCC=CCCCCC)
OP(=O)([O-]) [O-])
OC [C@H]3
O=c1 c(
COc1cc(/C=C/ C(=O)
CCCCCC= CCCCCCCCC</w>
CCCC 1</w>
CCC( N)=O)
CCC /C=C/
CC(=O)N [C@@H](C
C=C(C) C1
C1CCC2(C)C1 C(O)CC1C3(C)CC
C(=O) OC(
C /C=C(\C)
( c1ccccc1)
n4 cnc5
c3cc( OC)
c2n cc
[C@]1 (C)
[C@H]( NC(=O)
CCCCCCCC CC(=O)
CC/C=C\ C/C=C\C/C=C\
CC(OC6 OC(CO)C(OC7
CC [C@H](C)
C1 (C)C</w>
C(OC3 OC(CO)C(O)C(O)C3O)
C(=O)OC[C@H](C O)
=C /
cc c2
c2cc( OC)
[o+] c2-
P(=O)(O) O)
OC(=O)CCCCCCCC= CCC=CCCCCC</w>
C[C@]12CC[C@H]3 [C@@H](
C[C@@H]1 O[C@@H](
CO P(=O)([O-])
C(O) C3O)
C( CC)
cn c4
c5 c(
c1c(O)cc(O) c2c1
c( CCC(=O)O)
O=C( OC1
C(C) C1CCC2C3
C 3</w>
c6 cc
c2ccc( F)cc
c(O) n
[nH] 2)
Cc1 cn
CCCCC/C=C\ C/C=C\C/C=C\
C(O) C2O)C(O)C(O)C1O</w>
C(=O)O[C@H](COC(=O)CCCCCCCC CC=
A l
(C(=O)O) CCC3(C)C(=CCC4C5(C)CC
c3cc(O)cc(O) c3c2=O)
c2ccccc2 )cc1</w>
c1 OC)
OC(=O)CCCC=CCC=CCC= CCCCCCCCC</w>
N= C1
CC(O) =N
C1= C(C)
C(=O)O[C@@H](CO)COC(=O) CCCCCCCC
C [C@@H](C)
C /C=C(/C)
4 C)
n c(N
c2cc(O) c(O)c(O)
[C@@]2 1C</w>
Oc2cc(O) c3c(=O)
OCC(O)C(O) C3O)
O c3cc(O)
COc1cc(- c2[o+]
CN 2
= C(C)
c(O)c(OC) c1</w>
[C@@H](O)[C@H](O) [C@H](O)
[C@@H](CO) O[C@@H](
[C@@H] 5
C[C@H]3 O</w>
C[C@H]( CCC(=O)O)
CC[C@@] 43C)[C@@H]1
CC3 5
[C@@]1 (C)
OC(CO)C(O) C2O)C(O)C(O)C1O</w>
CCCCCCCCCCCCCCCC CCCCCC(=O)
CCCCCC=CCC=CCCCCCCC CC
CC1(C) C</w>
= C1
2 C)
1) N
/ N=C(
n2 cc
c3cc(O)c(O)c(O) c3-
c(C) n
c( F)cc
[P@@ ](=O)(O)
[C l
OC(C OC2
N=C(O) [C@H](
COc1cc c(C2
CCCC C[C@H](O)
CCCC C(=O)O</w>
CC [C@H](O)
CC /C=C(/C)
C(OC6OC(C(=O)O) C(O)
